pmo-dataset/variations/graphviz_basic/34.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "New order received" -> "ExclusiveGateway_3";
  "Order Lego brick sets" -> "Give the lego sets to the children";
  "Give the lego sets to the children" -> "Sort the parts into containers";
  "Parts remained?" -> "ExclusiveGateway_1" [label="Yes"];
  "ExclusiveGateway_1" -> "Container empty?";
  "ExclusiveGateway_2" -> "Build the next subcomponent";
  "Build the next subcomponent" -> "Parts remained?";
  "Container empty?" -> "Reorder parts" [label="Yes"];
  "Reorder parts" -> "ExclusiveGateway_2";
  "Container empty?" -> "ExclusiveGateway_2" [label="No"];
  "ParallelGateway_1" -> "Test subcomponent 1";
  "ParallelGateway_1" -> "Test subcomponent 4";
  "Test subcomponent 4" -> "ParallelGateway_2";
  "Test subcomponent 3" -> "ParallelGateway_2";
  "Test subcomponent 1" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "All tests successfull?";
  "Assemble subcomponents" -> "Machine assembled";
  "Test subcomponent 2" -> "ParallelGateway_2";
  "ExclusiveGateway_3" -> "Develop basic design";
  "All tests successfull?" -> "ExclusiveGateway_3" [label="No"];
  "All tests successfull?" -> "Assemble subcomponents" [label="Yes"];
  "Parts remained?" -> "ParallelGateway_1" [label="No"];
  "Develop basic design" -> "Brick sets already ordered?";
  "Brick sets already ordered?" -> "Order Lego brick sets" [label="No"];
  "Sort the parts into containers" -> "ExclusiveGateway_4";
  "ExclusiveGateway_4" -> "ExclusiveGateway_1";
  "Brick sets already ordered?" -> "ExclusiveGateway_4" [label="Yes"];
  "ParallelGateway_1" -> "Test subcomponent 2";
  "ParallelGateway_1" -> "Test subcomponent 3";

  "New order received" [shape=circle, label="New order received"];
  "Machine assembled" [shape=circle, label="Machine assembled"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "Parts remained?" [shape=diamond];
  "Container empty?" [shape=diamond];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "All tests successfull?" [shape=diamond];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "Brick sets already ordered?" [shape=diamond];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
}
