pmo-dataset/variations/mermaid_basic/34.mmd
graph LR
	StartEvent_1(("New order received")) --> ExclusiveGateway_6{"X"}
	Task_2["Order Lego brick sets"] --> Task_7["Give the lego sets to the children"]
	Task_7 --> Task_8["Sort the parts into containers"]
	ExclusiveGateway_2{"Parts remained?"} -->|"Yes"| ExclusiveGateway_1{"X"}
	ExclusiveGateway_1 --> ExclusiveGateway_3{"Container empty?"}
	ExclusiveGateway_4{"X"} --> Task_9["Build the next subcomponent"]
	Task_9 --> ExclusiveGateway_2
	ExclusiveGateway_3 -->|"Yes"| Task_10["Reorder parts"]
	Task_10 --> ExclusiveGateway_4
	ExclusiveGateway_3 -->|"No"| ExclusiveGateway_4
	ParallelGateway_1{"+"} --> Task_3["Test subcomponent 1"]
	ParallelGateway_1 --> Task_6["Test subcomponent 4"]
	Task_6 --> ParallelGateway_2{"+"}
	Task_5["Test subcomponent 3"] --> ParallelGateway_2
	Task_3 --> ParallelGateway_2
	ParallelGateway_2 --> ExclusiveGateway_5{"All tests successfull?"}
	Task_11["Assemble subcomponents"] --> EndEvent_1(("Machine assembled"))
	Task_4["Test subcomponent 2"] --> ParallelGateway_2
	ExclusiveGateway_6 --> Task_1["Develop basic design"]
	ExclusiveGateway_5 -->|"No"| ExclusiveGateway_6
	ExclusiveGateway_5 -->|"Yes"| Task_11
	ExclusiveGateway_2 -->|"No"| ParallelGateway_1
	Task_1 --> ExclusiveGateway_7{"Brick sets already ordered?"}
	ExclusiveGateway_7 -->|"No"| Task_2
	Task_8 --> ExclusiveGateway_8{"X"}
	ExclusiveGateway_8 --> ExclusiveGateway_1
	ExclusiveGateway_7 -->|"Yes"| ExclusiveGateway_8
	ParallelGateway_1 --> Task_4
	ParallelGateway_1 --> Task_5
